source/_posts/2014-04-20-mysql统计.html
---
title: "MySQL统计"
date: 2014-04-20
layout: post
categories: MySql
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">按日期统计</h2>
<div class="outline-text-2" id="text-1">
<p>
代码：<br  />
</p>
<div class="org-src-container">

<pre class="src src-SQL">-- 按年统计
SELECT YEAR(`date_field`), COUNT(*) AS `total`
FROM `table`
GROUP BY YEAR(`date_field`)

-- 按年月统计
SELECT YEAR(`date_field`), MONTH(`date_field`), COUNT(*) AS `total`
FROM `table`
GROUP BY YEAR(`date_field`), MONTH(`date_field`)

-- 按年月日统计
SELECT YEAR(`date_field`), MONTH(`date_filed`), COUNT(*) AS `total`
FROM `table`
GROUP BY YEAR(`date_field`), MONTH(`date_field`), DAY(`date_field`)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">一个字段不同的统计条件</h2>
<div class="outline-text-2" id="text-2">
<p>
使用 <b>CASE</b> 关键字<br  />
代码：<br  />
</p>
<div class="org-src-container">

<pre class="src src-SQL">/* 我需要按月统计完成的订单中客户给5星评价和给4星评价的数目*/
SELECT
    YEAR(`finishtime`),
    MONTH(`finishtime`),
    (CASE WHEN `rate`=5 THEN 1 ELSE NULL END),
    (CASE WHEN `rate`=4 THEN 1 ELSE NULL END),
FROM `order`
GROUP BY YEAR(`finishtime`), MONTH(`finishtime`)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">杂项</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">为什么使用 ` `</h3>
<div class="outline-text-3" id="text-3-1">
<p>
为了区别SQL关键字和数据库的字段。<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">为什么不用IS NULL 和 IS NOT NULL来过滤数据</h3>
<div class="outline-text-3" id="text-3-2">
<p>
使用IS NULL 或这IS NOT NULL 无法命中索引，导致效率问题，<br  />
可以使用 `field`&gt;'' 或者 `field`&gt;0替换上述情况。<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">SQL 规范</h3>
<div class="outline-text-3" id="text-3-3">
<p>
SQL 的关键字都用大写。 <br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">SQL注释</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-SQL">-- 是单行注释
/*多行注释*/
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">MySQL 时间戳函数</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-SQL">UNIX_TIMESTAMP(datetime)
FROM_UNIXTIME(unixtime)
</pre>
</div>
</div>

<ul class="org-ul"><li>最后更新<span class="timestamp-wrapper"><span class="timestamp">[2014-04-20 日 20:24]</span></span><br  /><div class="outline-text-6" id="text-3-5-0-0-1">
<p>
<!-- more -->
</p>
</div>
</li></ul>
</div>
</div>
